In [176]:
import pandas as pd
import seaborn as sns  
import numpy as np 

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [177]:
#a
titanic['category1'] = titanic.apply(lambda x: x['sex'] if x['age'] >20 else 'child', axis=1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male

In [178]:
titanic['age'].isna()
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [179]:
#b
titanic.age.fillna( titanic['age'].mean() , inplace=True )
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [180]:
#c.성별, 선실(class)별, 출발지(embark_town)별 생존율
titanic.shape #총 891명

(891, 16)

In [183]:
type('survived')
titanic['survived'].astype(int)

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [186]:
titanic['survived'].sum()

342

In [198]:
titanic['survived'].count()

891

In [215]:
#c-1 성별 생존율
df1 = pd.DataFrame(titanic.groupby('sex')[ ['survived'] ].count())
df1

df1['survive_ratio'] = df1['survived'] / titanic['survived'].count()
df1

        survived  survive_ratio
sex
female       314       0.352413
male         577       0.647587

In [219]:
# del df1['survived']
df1

        survive_ratio
sex
female       0.352413
male         0.647587

In [61]:
#c-2 선신별 생존율
titanic.groupby('class')[ ['survive_rate'] ].mean()

        survive_rate
class
First       0.182593
Second      0.137120
Third       0.070285

In [224]:
df2 = pd.DataFrame(titanic.groupby('class')[ ['survived'] ].count())
df2['survive_ratio'] = df2['survived'] / titanic['survived'].count()
df2

del df2['survived']

In [225]:
df2

        survive_ratio
class
First        0.242424
Second       0.206510
Third        0.551066

In [226]:
#c-3 출발지별 생존율
df3 = pd.DataFrame(titanic.groupby('embark_town')[ ['survived'] ].count())
df3['survive_ratio'] = df3['survived'] / titanic['survived'].count()
df3

del df3['survived']

In [227]:
df3

             survive_ratio
embark_town
Cherbourg         0.188552
Queenstown        0.086420
Southampton       0.722783

In [65]:
#d.타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고 각 그룹별 생존율을 구하시오.

titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,survive_rate
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,0.00
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,0.29
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,0.29
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,0.29
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,0.00

In [85]:
ages = titanic['age']
bins = [1, 20, 30, 50, 70, 100]  #카테고리를 나누는 기준값
labels = ["미성년자", "청년", "중년", "장년", "노년"]

cats = pd.cut(ages, bins, labels=labels)
cats

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: age, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [86]:
titanic['age_categ'] = cats

In [87]:
titanic.groupby('age_categ')[ ['survive_rate'] ].mean()

           survive_rate
age_categ
미성년자           0.123030
청년             0.096904
중년             0.122739
장년             0.103220
노년             0.058000

In [230]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male

In [238]:
#e.qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오
data = titanic['age']
titanic['qcats'] = qcats = pd.qcut(data, 3, labels=["Q1", "Q2", "Q3"])

In [239]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,qcats
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,Q1
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,Q3
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,Q2
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,Q3
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,Q3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,Q2
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,Q1
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,Q2
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,Q2
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,Q3

In [267]:
# 나이 그룹별 남녀 성비 와 생존율
titanic.groupby( ['qcats', 'sex'] )[ ['sex'] ].count()

              sex
qcats sex
Q1    female  122
      male    179
Q2    female   97
      male    207
Q3    female   95
      male    191

In [269]:
titanic.pivot_table('sex'.count(), index=['qcats','sex'])

TypeError: count() takes at least 1 argument (0 given)